skipruntime-ts/load_tests/tests/simple/test.yml
config:
  processor: ./helpers.js
  phases:
    - duration: 1
      arrivalRate: 10
  engines:
    skip:
      control_url: http://ec2-15-188-59-143.eu-west-3.compute.amazonaws.com:8081
      stream_url: http://ec2-15-188-59-143.eu-west-3.compute.amazonaws.com:8080
  target: unused

scenarios:
  - name: replicate_simple_writes
    # weight: 10
    engine: skip
    flow:
      - stream:
          resource: foo
          onUpdate: onUpdate
      - log: "[VU {{ $uuid }}] connected"
      - loop:
          - write:
              collection: foo
              data:
                - ["{{ $uuid }}-{{ $loopCount }}", ["4c0c426960fa2e5dd39b82fa5fe6573e5baaa5c6ed11cf3a5c8476b5c5d82a8d2595338241b1eb658f3ca55b31b21fdd72d5529e34abe19bd001987da9a17f1a25b5818f55eb33b06650e066664eb3bcf00df4c48d4100fe14b27322d07686d67034ff1bde238aa4cd3b32546f81d412e613dad3ab35d239329e74c3e271eb056e1b6524acab0f974bbfc43de17c8398d1a9c9e213715465a2f0b4a3a19e8cac4a9c246305532e256a8c4aa617daa05a21acf109c272220bdd01b5120d62f162f6d9d5c0c6be324b1e2f02975083860739604904ac53a15041aaef3966d7d6f11797305ec2331a4030a66a22ccc5bf6902a43ecbfb7640f5ff5ff2949d417df230247b299d734cc27e701279f802b9427cee7208487b522a2b55e46ed81c73ff3d0991e423f216a28e3663faec684d9fd2f1f60a9992fb4423794261844c477432f25f16547c63c35a0b7063d5a2c4d1c7c31345414d51f9e38a5bf5a9f01552e455af7afa83d2baf9b76c7c8d7835a47016072d5fb106c27c68f9b64d6de5f66efd6f2473a2769b5321780c4189656733527b90673b316e0489752838a34ef111a58766919406720328ce52bb5c534ec9aed5f1714d50ce7442ed33252f0f1b61ab3a16b6d314dfd3185d304f33d8e2c00d73edfa1c7f3c7685e7d0516e09ea6b1ad89d4bb33ac3fb445a1528f84cc618347f12885423c2655f3a2254a6d31324ec30f5dfd91ec3cb9fca84bc8fc2cbf67d2fc41c5c44f64a0e788d52a3cffa06137a1952b47aca0159e38f356ba9545d1c5a4c74b5d0acb33b410c4e490c897dbce8501306d347e74762209b61a87147d3081e718bc5d958149a08689157ecf8efefaafe8c505f6a655155e57cb2617c2fb9a6d87c3de6fc563960f33726cd15e179c090f155ba31ec3a64ea25de7417befc5a514300a84ecc72e6fbf18752d375cb24fa3b6ac7583d2304169d17d54343c51be9be53551fcf1e3649820a7766dae7c97092aa17b0ec1122b07b28a9935ad9ee7090989447813913f76c8c68a7f81d780385d7126ac1b6afdc675d6f60b6044bf52748d19b60f4e9bb3d54781ed558ca1bf1db16df3fa55428b513a1a07ac49544da9bbe03c254a9bf40895633cae530d47c3e6ec9bc8bb6bce3882e313cfdcd27b39a4a8e597920e69f0864cf53dcfc0b9c7abcac5095ce3dc9f6cf8e8fe2fda78ae32253110cd7a743421b549a22155a239f2e00e41cbcd6768529bf8551c876ccfe45dde0f166d236fd7954406968764875a1ce228ec045fd7b92191d2e68d65a0cf16351bf27967cd8da06b35ef82c48c1ddd9dd80f9a70f1cc0a9128dd8d28ed0cef887c669c8f3b60dbe258dd56e55a3cd3bfcc02b5b8f5105e8bf95c079d7dedb81e2af4be0ba6de8a5db766f282df4a6bdaa42c22690a845ed59f2ab6499982457b73c506cda97454c0f347f4eb8cac9cb690bf247784e4ee78e884e183eb9eb8aa67881b2f4c2b08b9d1bc29f926a1c4b37664ac428d312e60dab208f60bc5ef69a0123a8575dfdc84b7e120d71252efe13ff32aa7d7f04b2cd4a4bf1c976acc86cb4ff1dd745717e598097d78b145effa968a40fd09b18f4b6bdeaeefdcdf6b5fff4e12a79937f59a8a5021d5a7ddcea3820dcc98b5db3318e8d3fd3d4ea62ac412c2839070f7be3f102d97d10e077d2a3a05f430495dee85421b1c4f9f1064706ae4116fecf1e7983ff9f2be13c0e47659100032fd7ef79ed8816010a0d928900c5926a9a10f0a0c64eca7edf79c8930affaf22af4e7518f46916e209c1b66374903a65d29781ef84f4ce605a5dc59611b5b897ffeac40f1bce1eed25b45d140d9768b0b1726c9f5f93bf4ed731a798afea4648d7836b247d6c8346a14e4673f8472a8d6ea02c549696d4900a9bdbd926a02a1ec37a7aafd31685f6969becacf6843e77cba0c4cb88cd43594a43ada923de4401287f24d57c9b224f7009e0b80cc7bdae4a2f16b61cc87e15d50e2363a52e9959a37eddb4a05ef32c7b2f5c56c69c2bb2f7ec38786208adfdb90645b5767deeac663747dd6d1e68af87690321edb6eb35c0ac16f89f64795034b83b755637e85e8a09b089c44c0ed30f9fa50a51f1d31c5b2e6da87a4835315b8e2d2be1bc1e6caad6ea216ae3b1c7c17d7eac423a9578bf41a5e8f9cbfd99864649519d4e7c18a0c16fc6a4cb273d3f1ad3da8971755c2abb0b1322714a60977e2c15996070d9082024b2213228742df5fd6550e885a5b809c7761a981efd1203b5c3aa2ff4323db1b962164017b7603b9e2a99f78316068fe5b29de41875cc5fc630f48fde85716f4f69c22dbfc017b08bc8701b7e6aee031d1953f807f78e95b0a149a53fe797b8b6ba572d21c5ac9bbabf0e3fa61f004f9f9e95eac0a82478ba5e3517cf3f8bdd8c145d9c4683bcef73c68743717ef756ed51ef631b4b4fa4cd28bc60f02af63ef4abbd6a48843e2290cd079b01b9a08e90f764d6aba45a524c7ae1c74195f1240e15f37597570f9d0463c506b55e3d4ac972b59698c08a28532baad3d2b1a0c82b765d3fc3c4b6cce833e12ce0dbc727f158e110f8450412ab267273148896f40f9cdac5328963f6d1f4da624010c99720bd25dcf5ad9cde80d08de98a99eee016b6ca30a34594cef9458eb47e795d637513f9b4a31e66ae4dba39e74a3e1c7f6f877e48a9309f873714a7021d04e539d7ce083a5c7cd0e639db2b5cd49094e206e2df9af29ce11aee1caa5acff2b50dbb9e8bcf9e857cd768fa533da2ba92965042bbe1f0cba10c786e615232f94dd855cd4862270effe30b212faecf28fb86e7c90ea2a49bf63f173fb452b11d1b80d0c55b712341d595861788abade6dd545792b7eb5eefa676d1e7010395831adb6f"]]
              hook: writeHook
        count: 100
      - loop:
          - log: "[VU {{ $uuid }}] Writes replicated: {{ writes_replicated }} / {{ writes_issued }}"
          - think: 1
        whileTrue: allWritesReplicated
      - log: "[VU {{ $uuid }}] closing"
      - close
  # - name: simple_reader
  #   weight: 100
  #   engine: skip
  #   flow:
  #     - stream:
  #         resource: foo
  #         onUpdate: onUpdate
  #     - log: "[VU {{ $uuid }}] connected"
  #     - think: 60
  #     - log: "[VU {{ $uuid }}] closing"
  #     - close