skipruntime-ts/load_tests/tests/simple/test.yml
config:
  processor: ./helpers.js
  phases:
    - duration: 1
      arrivalRate: 10
  engines:
    skip:
      control_url: https://{{CONTROL_URL}}:8081
      stream_url: https://{{STREAM_URL}}:8080
  target: unused

scenarios:
  - name: replicate_simple_writes
    # weight: 10
    engine: skip
    flow:
      - stream:
          resource: foo
          onUpdate: onUpdate
      - log: "[VU {{ $uuid }}] connected"
      - loop:
          - write:
              collection: foo
              data:
                - ["{{ $uuid }}-{{ $loopCount }}", ["x"]]
              hook: writeHook
        count: 100
      - loop:
          - log: "[VU {{ $uuid }}] Writes replicated: {{ writes_replicated }} / {{ writes_issued }}"
          - think: 1
        whileTrue: allWritesReplicated
      - log: "[VU {{ $uuid }}] closing"
      - close
  # - name: simple_reader
  #   weight: 100
  #   engine: skip
  #   flow:
  #     - stream:
  #         resource: foo
  #         onUpdate: onUpdate
  #     - log: "[VU {{ $uuid }}] connected"
  #     - think: 60
  #     - log: "[VU {{ $uuid }}] closing"
  #     - close